// 诞生和消亡 - 初始化和反初始化

//初始化 - 默认构造器
struct 武器 {
    var 持久 :Int
    var 攻击力 :Int
    var 主人:String

}

var 一把武器 = 武器(持久: 8, 攻击力: 9, 主人: "nil")



//多初始化
class 战士 {
    var 武器攻击力 :Int
    var 头盔攻击力 :Int
    var 戒指攻击力 :Int
    var 战衣攻击力 :Int
    var 经验倍数   = 1
    var 服务器名:String?
    
    //指定构造器,倾向唯一性
    init (武器攻击力:Int,头盔攻击力 :Int,戒指攻击力 :Int,战衣攻击力 :Int) {
        self.武器攻击力 = 武器攻击力
        self.头盔攻击力 = 头盔攻击力
        self.戒指攻击力 = 戒指攻击力
        self.战衣攻击力 = 战衣攻击力
    }
    //便利构造器,可以多个
    convenience init (经验倍数:Int, 武器攻击力:Int,头盔攻击力 :Int,戒指攻击力 :Int,战衣攻击力 :Int) {
        self.init(武器攻击力:武器攻击力,头盔攻击力 :头盔攻击力,戒指攻击力 :戒指攻击力,战衣攻击力 :战衣攻击力)
        
        self.经验倍数 = 经验倍数
    }
    
    convenience init (服务器名:String, 武器攻击力:Int,头盔攻击力 :Int,戒指攻击力 :Int,战衣攻击力 :Int, 经验倍数:Int) {
        self.init(经验倍数:经验倍数, 武器攻击力:武器攻击力,头盔攻击力 :头盔攻击力,戒指攻击力 :戒指攻击力,战衣攻击力 :战衣攻击力)
        self.服务器名 = 服务器名
        
    }
    
    
    var 总攻击力 : Int {
        return 经验倍数 * (武器攻击力 + 头盔攻击力 + 戒指攻击力 + 战衣攻击力)
    }
}


var 小波战神 = 战士(服务器名: "VIP一区", 武器攻击力: 50, 头盔攻击力: 20, 戒指攻击力: 15, 战衣攻击力: 30, 经验倍数: 5)
let 小波未付费战士 = 战士(武器攻击力: 20, 头盔攻击力: 5, 戒指攻击力: 5, 战衣攻击力: 8)
小波未付费战士.总攻击力
小波战神.总攻击力





